## Terraform Results for gradient-metal`
#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.gradient_metal.module.gradient_processing.data.kubernetes_service.traefik will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "traefik" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.gradient_metal.module.gradient_processing.helm_release.gradient_processing will be created
  + resource "helm_release" "gradient_processing" {
      + atomic                     = false
      + chart                      = "gradient-processing"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gradient-processing"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://infrastructure-public-chart-museum-repository.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "1.4.347"
      + wait                       = true
      + wait_for_jobs              = false

      + set_sensitive {
          + name  = "global.artifactsAccessKeyId"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "global.artifactsSecretAccessKey"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "secrets.amqpUri"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "secrets.clusterApikey"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "secrets.clusterAuthorizationToken"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name = "secrets.tlsCert"
        }
      + set_sensitive {
          + name = "secrets.tlsKey"
        }
      + set_sensitive {
          + name  = "traefik.acme.dnsProvider.name"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "traefik.ssl.defaultCert"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "traefik.ssl.defaultKey"
          + value = (sensitive value)
        }
    }

  # module.gradient_metal.module.gradient_processing.random_password.nats_token will be created
  + resource "random_password" "nats_token" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.gradient_metal.module.kubernetes.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./gradient-kubeconfig"
      + id                   = (known after apply)
    }

  # module.gradient_metal.module.kubernetes.null_resource.rke_nodes_wait[0] will be created
  + resource "null_resource" "rke_nodes_wait" {
      + id = (known after apply)
    }

  # module.gradient_metal.module.kubernetes.null_resource.rke_nodes_wait[1] will be created
  + resource "null_resource" "rke_nodes_wait" {
      + id = (known after apply)
    }

  # module.gradient_metal.module.kubernetes.null_resource.rke_nodes_wait[2] will be created
  + resource "null_resource" "rke_nodes_wait" {
      + id = (known after apply)
    }

  # module.gradient_metal.module.kubernetes.rke_cluster.main will be created
  + resource "rke_cluster" "main" {
      + api_server_url            = (known after apply)
      + ca_crt                    = (sensitive value)
      + certificates              = (sensitive value)
      + client_cert               = (sensitive value)
      + client_key                = (sensitive value)
      + cluster_cidr              = (known after apply)
      + cluster_dns_server        = (known after apply)
      + cluster_domain            = (known after apply)
      + cluster_name              = "cluster-name"
      + control_plane_hosts       = (known after apply)
      + custom_certs              = false
      + dind                      = false
      + disable_port_check        = false
      + enable_cri_dockerd        = false
      + etcd_hosts                = (known after apply)
      + id                        = (known after apply)
      + inactive_hosts            = (known after apply)
      + internal_kube_config_yaml = (sensitive value)
      + kube_admin_user           = (known after apply)
      + kube_config_yaml          = (sensitive value)
      + kubernetes_version        = "v1.20.8-rancher1-1"
      + rke_cluster_yaml          = (sensitive value)
      + rke_state                 = (sensitive value)
      + running_system_images     = (known after apply)
      + ssh_agent_auth            = true
      + update_only               = false
      + worker_hosts              = (known after apply)

      + authentication {
          + sans     = []
          + strategy = "x509"

          + webhook {
              + cache_timeout = (known after apply)
              + config_file   = (known after apply)
            }
        }

      + ingress {
          + default_backend = true
          + provider        = "none"
        }

      + nodes {
          + address          = "master_ip1"
          + docker_socket    = "/var/run/docker.sock"
          + internal_address = "internal_master_ip1"
          + labels           = {
              + "node-role.kubernetes.io/controller" = "true"
              + "node-role.kubernetes.io/master"     = ""
              + "paperspace.com/pool-name"           = "services-small"
              + "paperspace.com/pool-type"           = "cpu"
            }
          + role             = [
              + "controlplane",
              + "etcd",
              + "worker",
            ]
          + ssh_agent_auth   = (known after apply)
          + user             = (sensitive value)
        }
      + nodes {
          + address          = "worker_ip1"
          + docker_socket    = "/var/run/docker.sock"
          + internal_address = "internal_ip1"
          + labels           = {
              + "node-role.kubernetes.io/node"   = ""
              + "node-role.kubernetes.io/worker" = ""
              + "paperspace.com/gradient-worker" = "false"
              + "paperspace.com/pool-name"       = "metal-gpu"
              + "paperspace.com/pool-type"       = "gpu"
            }
          + role             = [
              + "worker",
            ]
          + ssh_agent_auth   = (known after apply)
          + user             = (sensitive value)
        }
      + nodes {
          + address          = "worker_ip2"
          + docker_socket    = "/var/run/docker.sock"
          + internal_address = "internal_ip2"
          + labels           = {
              + "node-role.kubernetes.io/node"   = ""
              + "node-role.kubernetes.io/worker" = ""
              + "paperspace.com/gradient-worker" = "false"
              + "paperspace.com/pool-name"       = "metal-cpu"
              + "paperspace.com/pool-type"       = "cpu"
            }
          + role             = [
              + "worker",
            ]
          + ssh_agent_auth   = (known after apply)
          + user             = (sensitive value)
        }

      + services {
          + etcd {
              + ca_cert       = (sensitive value)
              + cert          = (sensitive value)
              + creation      = (known after apply)
              + external_urls = (known after apply)
              + extra_args    = (known after apply)
              + extra_binds   = (known after apply)
              + extra_env     = (known after apply)
              + gid           = (known after apply)
              + image         = (known after apply)
              + key           = (sensitive value)
              + path          = (known after apply)
              + retention     = (known after apply)
              + snapshot      = (known after apply)
              + uid           = (known after apply)

              + backup_config {
                  + enabled        = (known after apply)
                  + interval_hours = (known after apply)
                  + retention      = (known after apply)
                  + safe_timestamp = (known after apply)
                  + timeout        = (known after apply)

                  + s3_backup_config {
                      + access_key  = (sensitive value)
                      + bucket_name = (known after apply)
                      + custom_ca   = (known after apply)
                      + endpoint    = (known after apply)
                      + folder      = (known after apply)
                      + region      = (known after apply)
                      + secret_key  = (sensitive value)
                    }
                }
            }

          + kube_api {
              + always_pull_images       = (known after apply)
              + extra_args               = (known after apply)
              + extra_binds              = (known after apply)
              + extra_env                = (known after apply)
              + image                    = (known after apply)
              + pod_security_policy      = (known after apply)
              + service_cluster_ip_range = (known after apply)
              + service_node_port_range  = (known after apply)

              + audit_log {
                  + enabled = (known after apply)

                  + configuration {
                      + format     = (known after apply)
                      + max_age    = (known after apply)
                      + max_backup = (known after apply)
                      + max_size   = (known after apply)
                      + path       = (known after apply)
                      + policy     = (known after apply)
                    }
                }

              + event_rate_limit {
                  + configuration = (known after apply)
                  + enabled       = (known after apply)
                }

              + secrets_encryption_config {
                  + custom_config = (known after apply)
                  + enabled       = (known after apply)
                }
            }

          + kube_controller {
              + cluster_cidr             = (known after apply)
              + extra_args               = (known after apply)
              + extra_binds              = (known after apply)
              + extra_env                = (known after apply)
              + image                    = (known after apply)
              + service_cluster_ip_range = (known after apply)
            }

          + kubelet {
              + cluster_dns_server           = (known after apply)
              + cluster_domain               = "cluster.local"
              + extra_args                   = (known after apply)
              + extra_binds                  = []
              + extra_env                    = (known after apply)
              + fail_swap_on                 = (known after apply)
              + generate_serving_certificate = false
              + image                        = (known after apply)
              + infra_container_image        = (known after apply)
            }

          + kubeproxy {
              + extra_args  = (known after apply)
              + extra_binds = (known after apply)
              + extra_env   = (known after apply)
              + image       = (known after apply)
            }

          + scheduler {
              + extra_args  = (known after apply)
              + extra_binds = (known after apply)
              + extra_env   = (known after apply)
              + image       = (known after apply)
            }
        }

      + system_images {
          + kubernetes = "rancher/hyperkube:v1.20.8-rancher1"
        }

      + upgrade_strategy {
          + drain                        = false
          + max_unavailable_controlplane = "1"
          + max_unavailable_worker       = "10%"

          + drain_input {
              + delete_local_data  = (known after apply)
              + force              = (known after apply)
              + grace_period       = (known after apply)
              + ignore_daemon_sets = (known after apply)
              + timeout            = (known after apply)
            }
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @paperspace-sean, Action: `pull_request`, Working Directory: `gradient-metal`, Workflow: `pr`*